## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 1 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.neo4j will be updated in-place
  ~ resource "aws_ecs_service" "neo4j" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/cloud_asset_discovery/neo4j"
        name                               = "neo4j"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:12" -> (known after apply)
        # (15 unchanged attributes hidden)






        # (7 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.neo4j must be replaced
-/+ resource "aws_ecs_task_definition" "neo4j" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:12" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                    name             = "neo4j"
                  - volumesFrom      = [] -> null
                    # (8 unchanged elements hidden)
                },
            ]
        )
      ~ id                       = "neo4j" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - volume { # forces replacement
          - name = "neo4j-efs-volume" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-098d5b30c68ae5525" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null
            }
        }
      + volume { # forces replacement
          + name = "neo4j-efs-volume"

          + efs_volume_configuration {
              + file_system_id     = (known after apply)
              + root_directory     = "/"
              + transit_encryption = "ENABLED"
            }
        }
    }

  # aws_efs_backup_policy.neo4j will be created
  + resource "aws_efs_backup_policy" "neo4j" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # aws_efs_file_system.neo4j will be created
  + resource "aws_efs_file_system" "neo4j" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + throughput_mode         = "bursting"
    }

  # aws_efs_mount_target.neo4j[0] will be created
  + resource "aws_efs_mount_target" "neo4j" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-03caf974f268a3efb",
        ]
      + subnet_id              = "subnet-08cab5daf34489c53"
    }

  # aws_efs_mount_target.neo4j[1] will be created
  + resource "aws_efs_mount_target" "neo4j" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-03caf974f268a3efb",
        ]
      + subnet_id              = "subnet-07f8e17bbf11b0797"
    }

  # aws_efs_mount_target.neo4j[2] will be created
  + resource "aws_efs_mount_target" "neo4j" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "sg-03caf974f268a3efb",
        ]
      + subnet_id              = "subnet-0d92713028fd15243"
    }

Plan: 6 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
